//Breakpoints
[0212C380..0212C38F]!!?
[02324C6C]!!?

//Static Addresses :
02324F74 - Script Strings table.
02319888 - "ScriptStation load acting %d %s %d"
0231984C - "ScriptStation load common %d"
023198F0 - "ScriptStation_RemoveAll"
020A5490 - Lookup table, ScriptID to Resource String ( ex: 0x120 to S13P02A ) (Entries are 12 bytes long)

023196D8 - "SCRIPT/%s/enter.sse"
0209DFA0 - "SCENARIO CALC [%3d] %4d %4 -> %4d %4d"

2324C6Ch - Pointer to current SSA file buffer.
2324C8Ch - Pointer to current SSS file buffer.
2324C94h - Pointer to current SSE file buffer.

2324CF4h - Static struct that contains script engine runtime data. 
2324F8Ah - Static string containing the current script's name


//Function of interest:
200C240h - This is the dummied out debug printf function!
204C618h - This function seems to determine the next scenario to load??? It refers to the string "SCENARIO CALC [%3d] %4d %4 -> %4d %4d"
2064FFCh - GetScriptIDName looks up an indext to a script id in the 020A5490 table, and return the string ptr in R0
2089584h - Replace tokens in a file path. Works a bit like sprintf, but with some more code for handling paths



22E4BD4h - LoadScriptData
22E4CD4h - ScriptLocateSet

22E544Ch - LoadSSE
22E551Ch - LoadSSS
22E56B8h - LoadSSA
22E584Ch - LoadTalkExport
22E590Ch - LoadTalk

//These call ScriptLocateSet with various different parameters
22E59E8h
22E5A10h
22E5A38h
22E5A50h
2AE5A38h
2AE5A50h
//End

22E5D50h - LoadSSB  // EU: fcn.022e6690


22F7BC4h - DecideScriptDataToLoad

//Functions Handling OpCodes:
022DDD64 - Handle opcodes first pass. Classifies the opcodes using a value from 0 to 6, store it in script engine struct at 0xE
022E2480 - Hanlde some script opcodes. Unknown purpose
022DD164 - Calls 022DDD64, and 022E2480. Also does some handling of script data on its own depending on how the last instruction is classified.
022DD2C0 - Handles opcodes after they were handled by 022DD164 and 022DDD64. Uses value in the script engine struct at 0xE.


//Enums
//==hanger!!
enum ScriptDataTy
{
    ??? = 0,
    SSE = 1,
    SSS = 2,
    SSA = 3,
};

//Structure in memory - 2324CF4
struct CurrentSSBFilePointers_
{
    uint32_t PtrUnk1;           //00
    uint32_t unk2;              //04
    uint32_t unk3;              //08
    uint16_t unk4;              //0C
    uint16_t unkstate;          //0E When this is 5, it apparently loads a SSA/SSS/SSE file
    uint32_t unk6;              //10
    uint32_t PtrScriptDataHdr;  //14    
    uint32_t PtrScriptOpCodes;  //18
    uint32_t PtrUnk9;           //1C Possibly current opcode
    uint32_t PtrUnk10;          //20 Points one after the end of the SSB file, when no strings or constants
    uint32_t unk11;             //24
    uint32_t unk12;             //28
    uint32_t unk13;             //2C
    uint32_t unk14;             //30
    uint32_t PtrUnk15;          //34 Possibly previous opcode beg
    uint32_t PtrUnk16;          //38 Possibly previous opcode's first parameter

};
// 2324F74  //StructWithScriptData
// 2324D04  //PerformerEntryPointer
/*
Actor positions:
022F7FE8 E59F03F8 ldr     r0,=2324CF8h          // EU: 0x02325838
022F7FEC E1D410F0 ldrsh   r1,[r4]               //r1 = actortype
022F7FF0 E5902004 ldr     r2,[r0,4h]
022F7FF4 E3A00E25 mov     r0,250h
022F7FF8 E88D0C02 stmea   [r13],r1,r10,r11
022F7FFC E1DD31F2 ldrsh   r3,[r13,12h]          //r3 = actorid
022F8000 E1072089 smlabb  r7,r9,r0,r2           //r7 = (r9 * 250h) + r2
022F8004 E59F13E0 ldr     r1,=23219A4h          //"GroundLive Add id %3d  kind %3d  type %3d  hanger %3d  sector %3d"

Performer positions:
022FD7C0 E59F02A4 ldr     r0,=2324D04h          // EU: 0x02325844 //r0 = EntTablePtr?
022FD7C4 E1D410D0 ldrsb   r1,[r4]               //r1 = PerfTypeEntry?_Unk0
